Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བས་མི་སྐྱོ་བའི་རྒྱན་ལ་སྩོགས་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་དོན་ཡོད་པའི་དཀྱིལ་འཁོར་གྱི་རྒྱན་ལ་སྩོགས་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྟོབས་བཅུའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་མངོན་དུ་འགྱུར་བ་ལ་སྩོགས་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་སངས་རྒྱས་ཀྱི་རིགས་མི་ཟད་པའི་མཛོད་ལ་སྩོགས་པ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ལ་རྣམ་པར་བལྟ་བ་དང་། རྣམ་པར་དཔྱད་པ་དང་།
en: The upāsikā Acalā viewed, analyzed, followed, and realized gateways of bodhisattva liberations such as the essence of wisdom that is difficult to attain and many millions of gateways of samādhis: gateways of samādhis such as the display of the tireless search for the Dharma, samādhis such as the display of the unfailing domain, samādhis such as facing the display of the domain of the wisdom of the ten strengths, and samādhis such as the inexhaustible treasure of the buddha family.

source: རྗེས་སུ་འཇུག་པ་དང་། ངེས་པར་རྟོགས་པར་བྱས་སོ། །དེ་ལྟར་དགེ་བསྙེན་མ་མི་གཡོ་བ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཕྱོགས་བཅུར་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་རྣམ་པ་དྲུག་དུ་གཡོས་པ་དང་། བཻ་ཌཱུརྱ་ཡོངས་སུ་དག་པའི་རྒྱུ་ལས་གྱུར་པར་གནས་པར་མཐོང་ངོ་། །
en: As soon as the upāsikā Acalā rested in those samādhis, Sudhana, the head merchant’s son, saw world realms as numerous as the atoms in ten anabhilāpya buddha realms in the ten directions shake in six ways, and he saw that they were formed of pure beryl.

source: འཇིག་རྟེན་གྱི་ཁམས་རེ་རེའི་གླིང་བཞི་པ་བྱེ་བ་ཕྲག་བརྒྱ་བརྒྱན། དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཕྲག་བརྒྱ་བརྒྱ་བཞུགས་པར་མཐོང་སྟེ།
en: He saw in each world realm a billion tathāgatas in a billion four-continent world realms.

source: ལ་ལ་ནི་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་པ་ནས། ལ་ལ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མཛད་པའི་བར་དུ་འང་མཐོང་ངོ་། །
en: He saw some dwelling in Tuṣita and so on, up to some passing away into nirvāṇa.

source: དེ་ཡང་འཇིག་རྟེན་གྱི་ཁམས་བཻ་ཌཱུརྱའི་རང་བཞིན་དེ་དག་ཡོངས་སུ་དག་ཅིང་སྒྲིབ་པ་མེད་པའི་ཕྱིར་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་དག་སོ་སོ་ནས་འོད་ཟེར་དང་། འོད་ཀྱི་དཀྱིལ་འཁོར་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་རྒྱས་པར་ཁྱབ་པ་མངའ་བ་དང་། དེ་བཞིན་གཤེགས་པ་དེ་དག་སོ་སོའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་རྒྱ་མཚོ་ཡང་མཐོང་བར་གྱུར་ཏོ། །དེ་བཞིན་གཤེགས་པ་དེ་དག་རེ་རེའི་གསུང་གི་དཀྱིལ་འཁོར་ཆོས་ཀྱི་འཁོར་ལོ་ཐམས་ཅད་བརྗོད་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྣ་ལམ་དུ་རྣམ་པར་གྲགས་པའང་ཐོས་པར་གྱུར་ཏོ། །
en: He saw that because those completely pure world realms of beryl were unobscured, each of those tathāgatas pervaded the entire realm of phenomena with their light rays and halos; each of those tathāgatas had their own ocean of separate assemblies of followers; and each of those tathāgatas taught the wheel of the entire Dharma, which was heard by all beings, who listened to the domains of their speech.

source: དེ་ནས་དགེ་བསྙེན་མ་མི་གཡོ་བ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་མཐོང་ངམ།
en: Then the upāsikā Acalā rose from that samādhi and said to Sudhana, the head merchant’s son, “Noble one, did you see that?

source: ཐོས་སམ་ཤེས་སམ།
en: Did you hear that? Did you discern that?”

source: སྨྲས་པ་འཕགས་མ་མཐོང་ངོ་། །
en: He answered “I saw it.

source: ཐོས་སོ་རིག་གོ །
en: I heard it.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡི་དམ་བརྟན་པ་ལ་སློབ་ཅིང་།
en: I discerned it.”

source: ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བས་མི་སྐྱོ་བའི་རྒྱན་གྱི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་བཞག་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་སྒོ་ཐུབ་པར་དཀའ་བའི་ཡེ་ཤེས་ཀྱི་སྙིང་པ་ལ་གནས་ནས། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་སའི་གཟུངས་ཁོང་དུ་ཆུད་པ་དང་། སྤོབས་པའི་ཡེ་ཤེས་སྣང་བ་ཆོས་ཀྱི་གཞི་ཐམས་ཅད་སྣང་བ་བརྗོད་པ་ལ་མཁས་པའི་ལེགས་པར་བཤད་པས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པར་ཟད་ན་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་ཚད་མེད་བསམ་གྱིས་མྱི་ཁྱབ་པ་དང་ལྡན་པ་ནམ་མཁའི་དབྱིངས་ལ་འདབ་ཆགས་ཁྱུ་མཆོག་འཁོད་པ་ལྟར་གནས་མེད་པར་སྤྱོད་པ།
en: The upāsikā Acalā said, “Noble one, I have trained in the gateway of the bodhisattva conduct called possessing a strong commitment; I have rested in the samādhi called the display of the tireless search for the Dharma; I have dwelled in the gateway of bodhisattva liberations called the essence of the wisdom that is difficult to attain; I have realized the power of retention of the level of the equality of all phenomena; and through being skilled in describing the light of the wisdom of eloquence that elucidates the basis of all phenomena, I have taught beings and brought them satisfaction.

source: ནམ་མཁའ་ལྡིང་གི་དབང་པོ་ཆེན་པོ་ལྟར་ཡོངས་སུ་སྨིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་གདོན་པའི་ཕྱིར། སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒྱ་མཚོ་ལ་འཇུག་པ་ཚོང་པ་ལྟར་སྟོབས་བཅུའི་ཡེ་ཤེས་རིན་པོ་ཆེ་མངོན་པར་འདོད་ཅིང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རིན་པོ་ཆེའི་གླིང་དུ་རྒྱུ་བ། མཐུ་དང་ལྡན་པའི་ཉ་བ་ལྟར། ཡིད་དུ་འོང་བའི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་རྒྱ་དང་ལྡན་པའི་ལག་པས་སྲེད་པའི་ཆུ་ལས་བྱུང་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མངོན་པར་གདོན་པའི་ཕྱིར། ཆོས་ཀྱི་རྒྱ་མཚོ་ལ་རྣམ་པར་རྒྱུ་བ། ལྷའི་དབང་པོ་ལྟར་ཉོན་མོངས་པའི་ལྷ་མ་ཡིན་གྱི་གཡུལ་ཆེན་པོ་རྟུལ་བ་བཟློག་པའི་ཕྱིར། ཁམས་གསུམ་གྱི་གནས་ཡོངས་སུ་བཀང་ཞིང་རྣམ་པར་རྒྱུ་བ་ཉི་མའི་དཀྱིལ་འཁོར་ལྟར་སེམས་ཅན་གྱི་སྲེད་པའི་ཆུ་དང་། ཉོན་མོངས་པའི་འདམ་ཤིན་ཏུ་བསྐམ་པའི་ཕྱིར། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ནམ་མཁའི་དབྱིངས་ལ་ཡང་དག་པར་འཕགས་པ་ཟླ་བ་ཉ་ཞིང་རྒྱས་པ་ལྟར་འདུལ་བའི་ཡིད་ཀྱི་མེ་ཏོག་ཀུ་མུ་ཏ་རྣམ་པར་ཁ་དབྱེ་བའི་ཕྱིར།
en: “However, how could I know the conduct or describe the qualities of the bodhisattvas who possess measureless, inconceivable qualities; whose activity has no fixed location, like the lord of birds in the sky; who, like the great lord of the garuḍas, dive into the ocean of beings in order to extract the ripened bodhisattvas; who, like merchants, go the island of the jewels of omniscience, longing for the jewel that is the wisdom of the ten strengths; who, like strong fishermen, go onto the ocean of saṃsāra with the beautiful net of the domain of the wheel of the Dharma in their hands in order to draw ripened beings out from the water of craving; who, like the lord of the devas, move throughout the three realms, filling them in order to repel and subjugate the attacks of the asuras of the kleśas; who, like the disk of the sun, rise high in the sky of the realm of the Dharma in order to dry the water of the craving of beings and the mud of the kleśas; who, like the full moon, shine in the sky of wisdom in order to cause the night lotuses of the minds of those to be guided to blossom; who, like the surface of the Earth, support all equally without any distinction between those who are friends and not friends, or those who are high and those who are low, in order to cause the sprouts of the power of goodness in all beings to rise and grow; who, like a tempest, move everywhere without impediment in order to uproot the trees, vines, forests, and groves of the kleśas and false views of all beings; who, like a cakravartin, act within the world in order to gather all beings through conditions and requisites as methods of gathering pupils?

source: ཡེ་ཤེས་ཀྱི་ནམ་མཁའ་ལ་མངོན་པར་ཤར་བ། སའི་གཞི་ལྟར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དགེ་བའི་དབང་པོའི་མྱུ་གུ་བསྐྱེད་ཅིང་། རྣམ་པར་སྤེལ་བའི་ཕྱིར་བྱམས་མི་བྱམས་དང་། མཐོན་དམན་མེད་པར་འཇིག་རྟེན་ན་མཉམ་པར་གནས་པ་རླུང་མར་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་དང་། ལྟ་བའི་ཤིང་དང་ཤིང་ཕྲན་གྱི་ནགས་ཚལ་དང་། ཀུན་དགའ་རྩ་བ་ནས་གདོན་པའི་ཕྱིར་ཆགས་པ་མེད་པར་ཕྱོགས་ཐམས་ཅད་ཏུ་རྣམ་པར་རྒྱུ་བ། འཁོར་ལོས་སྒྱུར་བ་ལྟར་བསྡུ་བའི་དངོས་པོའི་ཡོ་བྱད་དང་། རྐྱེན་གྱིས་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་ཕྱིར། འཇིག་རྟེན་ན་རྣམ་པར་སྤྱོད་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་ཡུལ་དགའ་འཛིན་ཚད་མེད་པ་ན། གྲོང་ཁྱེར་དགའ་བ་འཛིན་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region, in a land called Amitatosala, there is a town named Tosala.

source: དེ་ན་ཀུན་ཏུ་རྒྱུ་ཐམས་ཅད་དུ་འགྲོ་བ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells the parivrājaka by the name of Sarvagamin.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་བསྙེན་མ་མི་གཡོ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏོ། །དགེ་བསྙེན་མ་མི་གཡོ་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། དགེ་བསྙེན་མ་མི་གཡོ་བའི་དྲུང་ནས་སོང་ངོ་། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བསྙེན་མ་མི་གཡོ་བ་མངོན་དུ་བྱས་ཏེ། དགེ་བསྙེན་མ་མི་གཡོ་བའི་གདམས་ངག་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་། དགེ་བསྙེན་མ་མི་གཡོ་བས་བསྟན་པ་དང་། ཡང་དག་པར་བསྟན་པ་དང་། བསྒྲགས་པ་དང་། བཤད་པ་དང་། བརྗོད་པ་དང་། ཡང་དག་པར་བརྗོད་པ་དང་། གཞག་པ་དང་། རྣམ་པར་ཕྱེ་བ་དང་། སྨོས་པ་དང་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the upāsikā Acalā, circumambulated the upāsikā Acalā a hundred thousand times, keeping her to his right, and, looking back again and again, departed from the presence of the upāsikā Acalā.

source: རྒྱ་ཆེར་བསྟན་པ་དེ་དག་ཐམས་ཅད་ལ་གདོན་མི་ཟ་བར་ཡིད་ཆེས་ཤིང་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། རྗེས་སུ་བསམ་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། སྒོམ་པ་དང་། ཡོངས་སུ་བསྒོམ་པ་དང་། གཞན་དུ་མི་འགྱུར་བ་དང་། རྟོགས་པར་བྱ་བ་དང་།
en: Sarvagamin Chapter 23 Then Sudhana, the head merchant’s son, visualizing in his mind the upāsikā Acalā, remembering the instruction of the upāsikā Acalā, with conviction in and no doubt about what the upāsikā Acalā had taught, proclaimed, instructed, described, sanctioned, established, explicated, stated, and elaborated upon it; he followed it, contemplated it, comprehended it, meditated on it, was absorbed in it, was fixed upon it, understood it, illuminated it, and became equal to it.

source: སྣང་བར་བྱ་བ་དང་། མཉམ་པར་བྱ་བ་མྱེད་ཅིང་། མཐར་གྱིས་གནས་ནས་གནས་དང་ཡུལ་ནས་ཡུལ་དུ་རྒྱུ་སྟེ། རྒྱུ་ཞིང་སོང་སོང་ནས་ཡུལ་དགའ་འཛིན་ཚད་མེད་པ་གང་ན་བ་དེར་ཕྱིན་ནས།
en: Eventually, traveling from district to district, going from land to land, Sudhana arrived at the land called Amitatosala.

source: གྲོང་ཁྱེར་དགའ་བ་འཛིན་པ་རྨེད་ཅིང་ཚོལ་ཚོལ་ཏེ། ཉི་མ་ནུབ་ཏུ་ཆབ་ཞིག་ན་གྲོང་ཁྱེར་དགའ་བ་འཛིན་པར་ཕྱིན་ནས།
en: He searched for the town named Tosala, and at sunset he arrived at the town of Tosala.

source: གྲོང་ཁྱེར་དགའ་བ་འཛིན་པའི་ནང་དུ་སོང་སྟེ། གྲོང་ཁྱེར་གྱི་ལམ་གྱི་བཞི་མདོའི་དབུས་ཤིག་ཏུ་ཕྱིན་ནས་སྲང་གི་སྒོ་ནས།
en: He entered the town of Tosala and went to the crossroads in the center of the town.

source: སྲང་གི་སྒོ་དང་ལམ་གྱི་བཞི་མདོ་ནས་ལམ་གྱི་བཞི་མདོ་དང་། གྲོང་ཕྲག་ནས་གྲོང་ཕྲག་ཏུ་ཀུན་ཏུ་རྒྱུ་ཐམས་ཅད་དུ་འགྲོ་བ་ཚོལ་ཞིང་རྨེད་རྨེད་པ་དང་།
en: He wandered from one street to another, from one crossroads to another, from one lane to another, searching and inquiring.

source: མཚན་མོ་མི་ཉལ་ཙམ་ཞིག་ན་གྲོང་ཁྱེར་དགའ་བ་འཛིན་པའི་བྱང་ཕྱོགས་ལོགས་ན།
en: When it was night and people were asleep, he saw to the north of the town of Tosala a hill called Sulabha.

source: རི་ཤིན་ཏུ་མོད་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དེའི་རྩེ་མོ་རྩྭ་དང་གེལ་པ་དང་། སྨན་སྣ་ཚོགས་དགའ་དགའ་ལྟར་སྐྱེས་པས་བརྒྱན་པ་འོད་ཆེན་པོ་དང་ལྡན་པ་ལ་ཉི་མ་ཤར་བ་ལྟ་བུར་གནས་པ་མཐོང་ངོ་། །
en: Its summit was adorned by a delightful variety of grasses, bushes, and herbs, and it shone as brightly as the sun.

source: དེས་སྣང་བ་དེ་མཐོང་ནས་དགའ་བའི་ཤུགས་ཆེན་པོ་སྐྱེས་ཏེ་འདི་སྙམ་དུ་བསམས་སོ། །བདག་གི་དགེ་བའི་བཤེས་གཉེན་རིའི་རྩེ་མོ་འདི་ལ་གདོན་མི་ཟ་བར་མཐོང་བར་འགྱུར་བ་ལྟ་ཞིག་སྙམ་ནས།
en: Seeing that light, he felt a powerful joy and thought, “I will without doubt see the kalyāṇamitra on the summit of that hill.”

source: གྲོང་ཁྱེར་དེ་ནས་བྱུང་སྟེ། རི་ཤིན་དུ་མོད་པ་གང་ན་བ་དེར་ཕྱིན་པ་དང་། རི་ཤིན་ཏུ་མོད་པ་དེ་ལ་འཛེགས་ནས། རིའི་རྩེ་མོ་སྣང་བ་ཆེན་པོ་ཅན་གང་ན་བ་དེར་ཕྱིན་པ་དང་།
en: He came out of the town and went to Sulabha Hill, and he climbed up Sulabha Hill and arrived at the very bright summit of the hill.

source: རྒྱང་རིང་པོ་ཞིག་ནས་ཀུན་ཏུ་རྒྱུ་ཐམས་ཅད་དུ་འགྲོ་བ་ཚངས་པ་ཆེན་པོ་བས་ཀྱང་ལྷག་པའི་ཁ་དོག་དང་ལྡན་པ་དཔལ་གྱིས་ཤིན་ཏུ་འབར་བ་ཞིག་ཚངས་པ་སྟོང་ཕྲག་བཅུས་ཀུན་ནས་བསྐོར་ཏེ། འཆགས་ནས་འཆག་ཅིང་འདུག་པ་མཐོང་ནས།
en: He saw in the distance the parivrājaka Sarvagamin, who shone with splendor and whose appearance was superior even to that of Mahābrahmā, and ten thousand brahmins were walking in circumambulation around him.

source: དེའི་དྲུང་དུ་ཕྱིན་ཏེ། རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། དེ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ།
en: Sudhana approached him, bowed his head to his feet, circumambulated him many hundreds of thousands of times, and sat down before him.

source: མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: With his hands placed together in homage, he said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: སྨྲས་པ་རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་པ་ལེགས་སོ། །
en: Sarvagamin said, “Noble one, it is excellent, excellent, that you have in that way set out upon the highest, complete enlightenment!

source: ལེགས་སོ་རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་ཐམས་ཅད་དུ་འགྲོ་བ་སྟེ། ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པའོ། །
en: “Noble one, I, Sarvagamin, remain within the all-pervading bodhisattva conduct.

source: སྒོ་ཐམས་ཅད་དུ་རྣམ་པར་སྤྱོད་པས་སྣང་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་དང་། དངོས་པོ་མེད་པ་ལ་གནས་པས། མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྫུ་འཕྲུལ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀུན་གྱི་གཞིར་ཐུག་པར་ཐལ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཡེ་ཤེས་སྣང་བའི་སྒོ་དང་ལྡན་པའོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་ནི་སེམས་ཅན་གྱི་སྣོད་ཀྱི་འཇིག་རྟེན་གྱི་རྒྱུད་ཐམས་ཅད་དང་།
en: I am endowed with the gateway of the samādhi called the light of the practice of all gateways, with being established in the absence of existence, with noncomposite miraculous powers, and with the gateway of the knowledge of the perfection of wisdom that has reached the basis of the entire realm of the Dharma.

source: སེམས་ཅན་གྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་ཤི་འཕོ་བའི་སྒོ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་སྐྱེ་བའི་སྒོ་ཐམས་ཅད་དང་། སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐ་དད་པ་ཐམས་ཅད་དང་། སྐྱེ་བའི་སྐྱེ་མཆེད་སྣ་ཚོགས་ཀྱི་འཇིག་རྟེན་གྱི་གནས་རྣམ་པ་ཐ་དད་པ་དག་གི་སེམས་ཅན་ཁ་དོག་དང་། དབྱིབས་དང་། ཆུ་ཞེང་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ། སྐྱེ་བ་ཀུན་ཏུ་འབྲེལ་པ། རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ། སྦྱོར་བ་སྣ་ཚོགས་དང་ལྡན་པ། མོས་པ་སྣ་ཚོགས་ཅན་འདི་ལྟ་སྟེ་ལྷའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། ཀླུའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། གནོད་སྦྱིན་གྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། དྲི་ཟའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། ལྷ་མ་ཡིན་གྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། ནམ་མཁའ་ལྡིང་གི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། མིའམ་ཅིའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། སེམས་ཅན་དམྱལ་བའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། མིའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། མི་མ་ཡིན་པའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། ལྟ་བའི་རྣམ་པ་སྣ་ཚོགས་ལ་གནས་པ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་མོས་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་མོས་པ་དང་།
en: “Noble one, in that way I benefit beings in the entire array of worlds inhabited by beings, in all the states of existences that beings are in, in all the gateways of the deaths of beings, in all the gateways of the births of beings, in all the different existences, in the various different abodes, and in the worlds that are habitations—beings who have various colors, shapes, heights, and widths and who have entered various kinds of rebirths, have different practices, and have different aspirations, which means those within existence as a deva, those within existence as a nāga, those within existence as a yakṣa, those within existence as a gandharva, those within existence as an asura, those within existence as a garuḍa, those within existence as a kinnara, those within existence as a mahoraga, those within existence as a hell being, those within existence as an animal, those within existence in the world of Yama, those within existence as a human, those within existence as a nonhuman, those who have various false views, those who aspire to the Śrāvakayāna, those who aspire to the Pratyeka­buddhayāna, and those who aspire to the Mahāyāna—benefiting them through various methods and through various introductions to the way of wisdom.

source: ཐེག་པ་ཆེན་པོ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་ཐབས་སྣ་ཚོགས་དང་། ཡེ་ཤེས་ཀྱི་ཚུལ་དང་སྦྱོར་བ་སྣ་ཚོགས་ཀྱིས་བྱེད་དེ། འདི་ལྟར་སེམས་ཅན་ལ་ལ་ལ་ནི་བཟོའི་རྒྱུད་ཐ་དད་པ་ཐམས་ཅད་དང་ལྡན་པའི་གཟུགས་སྣང་བས་འཇིག་རྟེན་གྱི་བཟོ་སྣ་ཚོགས་བསླབས་ཤིང་དོན་བྱེད་དོ། །
en: “This means that I benefit some beings with the light of the power of mental retention that possesses all the knowledge of the various crafts so that they will learn the various worldly crafts.

source: སེམས་ཅན་ལ་ལ་ནི་འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་བསྟབས་པའི་ཕྱིར་བསྡུ་བའི་དངོས་པོ་བཞིས་ཡོངས་སུ་བསྡུ་བའི་ཐབས་ཀྱིས་དོན་བྱེད་དོ། །
en: “I benefit some beings through the application of the four methods of gathering pupils, which means leading them to omniscient wisdom.

source: སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བའི་ཡེ་ཤེས་ཀྱི་སྒོ་སྣང་བ་ཡོངས་སུ་བསྐྱེད་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་བརྗོད་ཅིང་དོན་བྱེད་དོ། །
en: “I benefit some beings by describing the perfections, thus generating the light of the gateway of the wisdom that transforms into omniscience.

source: སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཀྱི་ས་བོན་ཆུད་མི་ཟ་བར་བརྟན་ཅིང་ཡོངས་སུ་བསྐྱེད་པས། བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཡོངས་སུ་བརྗོད་ཅིང་དོན་བྱེད་དོ། །
en: “I benefit some beings by describing the aspiration to enlightenment, thus developing an imperishable, strengthened seed of enlightenment.

source: སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་སྨོན་ལམ་ཡོངས་སུ་བསྐྱེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པ་ཐམས་ཅད་དུ་ཡང་དག་པར་བརྗོད་པས་དོན་བྱེད་དོ། །
en: “I benefit some beings by describing all the aspects of bodhisattva conduct, thus generating the aspiration to purify all buddha realms and ripen all beings.

source: སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ། ངན་དུ་སྤྱོད་པའི་རྣམ་པར་སྨིན་པ་དང་། མཐུན་པའི་རྒྱུས་སེམས་ཅན་དམྱལ་བའི་ལམ་གྱི་རྒྱུད་ཀྱི་སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བར་འགྱུར་བ་ཡོངས་སུ་བསྟན་པས། སྐྱོ་བ་ཡོངས་སུ་བསྐྱེད་ཅིང་དོན་བྱེད་དོ། །སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ།
en: “I benefit some beings by causing dismay, by teaching the sufferings experienced by beings in the hells caused by the ripening of their bad conduct.

source: དེ་བཞིན་གཤེགས་པ་ལ་བསྐྱེད་པའི་ཡོན་ཏན་ཐམས་ཅད་ནི་གདོན་མི་ཟ་བར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་འབྲས་བུའི་མཐར་ཐུག་པར་འགྱུར་བར་བརྗོད་པས། དགའ་བ་ཆེན་པོ་བསྐྱེད་ཅིང་དོན་བྱེད་དོ། །སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ།
en: “I benefit some beings by causing delight, by describing all the qualities that arise in the tathāgatas, which are the ultimate result of definite omniscience.

source: སངས་རྒྱས་ཀྱི་ཡོན་ཏན་དང་སྐུ་ལ་མངོན་པར་མོས་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྨོན་ལམ་འདེབས་པར་བྱ་བའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་དང་། བསྔགས་པ་ཡང་དག་པར་བརྗོད་པས་དོན་བྱེད་དོ། །
en: “I benefit some beings by speaking praises of the qualities of all the tathāgatas, thus generating the aspiration to omniscience and the longing for the qualities and body of a buddha.

source: སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ། མི་ཟློགས་ཤིང་ལྷུན་གྱིས་གྲུབ་པ་དང་། རྒྱུན་ཆད་པ་མེད་པར་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ནན་ཏན་དུ་མཛད་པའི་མཐུ་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་སྐུ་འཐོབ་པར་མོས་པ་བསྐྱེད་པའི་ཕྱིར། སངས་རྒྱས་ཀྱི་བདག་ཉིད་ཆེ་བ་བརྗོད་པས་དོན་བྱེད་དོ། །
en: “I benefit some beings by describing the greatness of the buddhas, thus generating the longing to attain the body of a buddha that possesses the power to undertake continuous, irresistible buddha activity.

source: སེམས་ཅན་ལ་ལ་ནི་འདི་ལྟ་སྟེ། ཚུར་ཟིལ་གྱིས་གནོན་ལ་ཕར་ཟིལ་གྱིས་མི་གནོན་པའི་སངས་རྒྱས་ཀྱི་སྐུ་ཕུན་སུམ་ཚོགས་པ་འཐོབ་པར་མོས་པ་བསྐྱེད་པའི་ཕྱིར། སངས་རྒྱས་ཀྱི་མངའ་ཆེན་པོ་ཡོངས་སུ་བརྗོད་ཅིང་དོན་བྱེད་དོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་ཁོ་བོ་ནི་གྲོང་ཁྱེར་དགའ་བ་འཛིན་པ་འདིའི་བཞི་མདོའི་ཕོངས་ཐམས་ཅད་དང་། སྲང་ཐམས་ཅད་དང་། ལམ་གྱི་སུམ་མདོ་ཐམས་ཅད་དང་། གྲོང་མཚམས་ཐམས་ཅད་དང་། ཁྱིམ་ཐམས་ཅད་དང་། མཐུན་པར་འདུས་པའི་རྡལ་ཐམས་ཅད་དང་གྲོང་ཐམས་ཅད་དང་།
en: “I benefit some beings by describing the dominance of the buddhas, thus generating the aspiration to attain the perfect body of a buddha, which cannot be surpassed but surpasses all others.

source: གྲོང་གི་རྒྱུད་ཐམས་ཅད་དུ་རྣམ་པ་ཇི་ལྟར་ཚོགས་ཤིང་འདུས་པའི་བུད་མེད་དང་། སྐྱེས་པ་དང་ཁྱེའུ་དང་བུ་མོ་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་དང་། སྦྱོར་བ་ཇི་ལྟ་བ་དང་། མཐུ་ཇི་ལྟ་བ་དང་། རྣམ་པར་སྤྱོད་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེ་དག་དང་། མཐུན་པའི་ལུས་ཀྱི་ཆུ་ཞེང་དང་དབྱིབས་མངོན་པར་བསྒྲུབས་ཤིང་།
en: “Moreover, noble one, I manifest a body of the size and shape that accords with the aspirations, activities, powers, and conducts of all the men, women, boys, and girls who are gathered in all the crossroads, streets, junctions, side streets, houses, trades, districts, and dwellings in the districts of this town of Tosala, and I teach them the Dharma.

source: ཆོས་སྟོན་ཀྱང་། སེམས་ཅན་དེ་དག་གིས་དེ་སུས་བསྟན་པ་དང་། དེ་ག་ལས་འོངས་པ་མི་ཤེས་ཏེ། གཞན་དུ་ན་ཐོས་ནས་མ་ནོར་བར་ནན་ཏན་དུ་བྱེད་པ་ནི་མེད་པའང་མ་ཡིན་ནོ། །
en: Those beings do not know who has taught them or where he has come from, but otherwise having heard me, they all practice correctly.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་འཛམ་བུའི་གླིང་འདི་ན། ཞགས་པ་འཐུབ་པ་ལྟ་བ་རྣམ་པ་སྣ་ཚོགས་ལ་མངོན་པར་ཞེན་པ། དགུ་བཅུ་རྩ་དྲུག་འཁོད་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ནང་དུ་ཡང་སེམས་ཅན་ལྟ་བའི་རྣམ་པ་སྣ་ཚོགས་ལ་ཆགས་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཐམས་ཅད་དང་མཐུན་པར་གནས་ཏེ། རིགས་ཀྱི་བུ་ཅི་ལྟར་ཁོ་བོ་གྲོང་ཁྱེར་དགའ་བ་འཛིན་པ་འདི་ན་སེམས་ཅན་གྱི་དོན་བྱེད་ཅིང་འདུག་པ་དེ་བཞིན་དུ་འཛམ་བུའི་གླིང་གི་གྲོང་དང་།
en: “Moreover, noble one, I go everywhere in this Jambudvīpa in order to ripen those who are attached to the ninety-six varieties of heretical views.

source: གྲོང་ཁྱེར་དང་། ལྗོངས་དང་། ཡུལ་དང་། ཁམས་དང་། རྒྱལ་པོའི་ཕོང་བྲང་འཁོར་ཐམས་ཅད་ན་ཡང་སེམས་ཅན་གྱི་དོན་བྱེད་དོ། །
en: “Noble one, in the same way that I benefit beings in this town of Tosala, I benefit beings in all the villages, markets, towns, lands, kingdoms, and capitals in Jambudvīpa.

source: འཛམ་བུའི་གླིང་ན་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དང་། དེ་བཞིན་དུ་སྟོང་དང་སྟོང་གཉིས་པ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དང་། དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སེམས་ཅན་གྱི་རྟེན་དུ་བྱ་བ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་གནས་སུ་བྱ་བ་ཐམས་ཅད་དང་།
en: In the same way that I benefit beings in Jambudvīpa, I do so in the entire four-continent world realm, and in a thousand such world realms, and in a million, and in the great world realms of a billion such world realms.

source: སེམས་ཅན་གྱི་གཞིར་བྱ་བ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་ཁམས་སུ་བྱ་བའི་མིང་དུ་གཏོགས་པ་ཐམས་ཅད་དང་། སེམས་ཅན་ཡོངས་སུ་རྒྱུ་བ་ཐམས་ཅད་དང་། སེམས་ཅན་ཡོངས་སུ་འདུ་བ་ཐམས་ཅད་དང་། སེམས་ཅན་རྒྱ་མཚོ་ན་གནས་པ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་རྒྱུད་གནས་པ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་ཕྱོགས་སུ་བྱ་བ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་ཕྱོགས་མཚམས་སུ་བྱ་བ་ཐམས་ཅད་དང་།
en: In the same way, I benefit beings according to their aspirations in all the world realms in the ten directions, in all the habitations of beings, in all the dwellings of beings, in all the locations of beings, in all that are known as the abodes of beings, in all the residences of beings, in all the congregations of beings, in all the oceans of beings, in all the lineages of beings, in all the directions of beings, in all the intermediate directions of beings, and in all the conducts of beings.

source: སེམས་ཅན་སྤྱོད་པའི་གནས་ཐམས་ཅད་དུ་འང་། ཐབས་སྣ་ཚོགས་དང་། ཚུལ་སྣ་ཚོགས་དང་། སྒོ་སྣ་ཚོགས་དང་། རིགས་པ་སྣ་ཚོགས་དང་།
en: I benefit beings through various methods, various ways, various gateways, various kinds of logic, various connections, various ways of methods, and various actions.

source: འཕྲད་པ་སྣ་ཚོགས་དང་། ཐབས་ཀྱི་ཚུལ་སྣ་ཚོགས་དང་། བྱ་བ་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ། །གཟུགས་དང་ཁ་དོག་སྣ་ཚོགས་ཡོངས་སུ་བསྟན་ཅིང་མོས་པར་བྱ་བ་དང་།
en: I benefit beings through the manifestation of various attractive physical forms and colors.
